#+title: Lab 4 MM5016
#+description: Solve linear equation AX=B
#+PROPERTY: header-args :tangle ./lab4.py :padline 2

** test av allt ovanför
#+begin_src python :results output :session :tangle no
print(matrix_multiply([[1,0],[0,1]], [[3],[4]]))
print(create_identity(3))
print(switch(0,1,3))
print(add_multiple_of_row_to_other_row(3,0,1,3))
print(matrix_multiply(scale_row(3,1,3), [[1,2,3],[4,5,6],[7,8,9]]))
#+end_src

#+RESULTS:
: [[3], [4]]
: [[1, 0, 0], [0, 1, 0], [0, 0, 1]]
: [[0, 1, 0], [1, 0, 0], [0, 0, 1]]
: [[1, 0, 0], [3, 1, 0], [0, 0, 1]]
: [[1, 2, 3], [12, 15, 18], [7, 8, 9]]

*** test: find next gaussian elimination task
#+begin_src python :results output :session :tangle no
print(find_next_gaussian_elimination_task([[1,0],[0,1]]))
#+end_src

#+RESULTS:
: ((-1, -1), 'finnished')

*** Gaussian elimination test
#+begin_src python :results output :session :tangle no
matrix = [[-3,-8,-5],[1,4,3],[6,10,-5]]
vector = [[3],[4],[5]]
result = gaussian_elimination(matrix, vector)
print(result)
print(matrix_multiply(matrix, result))
#+end_src

#+RESULTS:
: [[-14.72222222222222], [7.472222222222221], [-3.722222222222222]]
: [[2.9999999999999964], [4.0], [5.000000000000011]]

** stuff
#+begin_src python :results output :session :tangle no
matrix = [[1,2,3],[4,5,6],[7,8,9]]
new_matrix = add_multiple_of_row_to_other_row(matrix, -1, 0, 1)
swapped_matrix = swap_row_with_other_row(matrix,0,0)
print(new_matrix)
print(swapped_matrix)
#+end_src

#+RESULTS:
: [[1, 2, 3], [3, 3, 3], [7, 8, 9]]
: [[1, 2, 3], [4, 5, 6], [7, 8, 9]]

** gaussian elimination
#+begin_src python :results output :session :tangle no
print(gaussian_elimination(matrix))
#+end_src

#+RESULTS:
: [2, 4, 6, [0.0, -3.0, -6.0], [0.0, -6.0, -12.0]]

** detach and join
#+begin_src python :results output :session :tangle no
a1, a2 = detach_first_column(matrix)
print(join_column_wise(a1,a2))
#+end_src

#+RESULTS:
: [[1, 2, 3], [4, 5, 6], [7, 8, 9]]

** list slicing
#+begin_src python :results output :session :tangle no
matrix = [[1,2,3],[4,5,6],[7,8,9]]
print(matrix[0:2][0:1])
print(matrix[1:])
#+end_src

#+RESULTS:
: [[1, 2, 3]]
: [[4, 5, 6], [7, 8, 9]]

** Pureness python list functions
#+begin_src python :results output :session :tangle no
def pure(mylist):
    mylist = [420]
    return mylist

static_list = [3,4,5]
print(static_list)
pure(static_list)
print(static_list)
#+end_src

#+RESULTS:
: [3, 4, 5]
: [3, 4, 5]

** List comprehension
#+begin_src python :results output :tangle no
print ([(letter, number) for letter in ['a', 'b', 'c'] for number in range(2)])
#+end_src

#+RESULTS:
: [('a', 0), ('a', 1), ('b', 0), ('b', 1), ('c', 0), ('c', 1)]

** eliminate_first column and transpose
#+begin_src python :results output :session :tangle no
matrix = [[1,2,3],[4,5,6],[7,8,9]]
print(eliminate_first_column(matrix))
print(transpose(matrix))
#+end_src

#+RESULTS:
: [[1, 2, 3], [0.0, -3.0, -6.0], [0.0, -6.0, -12.0]]
: [[1, 4, 7], [2, 5, 8], [3, 6, 9]]

** Map indexing
#+begin_src python :results output :tangle no
stuff = list(map(lambda x: x+3, [1,2,3]))
print(stuff.index(4))
#+end_src

#+RESULTS:
: 0

*** Med klasser (för matrix based approach)

#+begin_src python :results output :session :tangle no
class Vector:
    def __init__(self, vector):
        self.elements = vector


    def __getitem__(self, key):
        return self.elements[key]


    def __len__(self):
        return len(self.elements)


    def __add__(self, other):
        return Vector([self[k] + other[k] for k in range(len(self))])

    
    def __mul__(self, other):
        if isinstance(other, int) or isinstance(other, float):
            return Vector([other * element for element in self.elements])
        elif isinstance(other, Vector):
            return sum([self[k] * other[k] for k in range(len(self))])


    def __rmul__(self, other):
        return self * other

    
    def __str__(self):
        return str(self.elements)


myvector = Vector([1,2,3])
print(-1 * myvector)
print(myvector + myvector)
#+end_src

#+RESULTS:
: [-1, -2, -3]
: [2, 4, 6]

